Conf.Simple/src/InformationRegisters/SUI_СостоянияМобильныхУстройств/SUI_СостоянияМобильныхУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_СостоянияМобильныхУстройств</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.SUI_СостоянияМобильныхУстройств</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_СеансыМобильныхУстройств/SUI_СеансыМобильныхУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_СеансыМобильныхУстройств</name>
  <resources>
    <name>Сеанс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСеанса</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>26</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>МеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_ЗапросыАвторизацииМобильныхУстройств/SUI_ЗапросыАвторизацииМобильныхУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ЗапросыАвторизацииМобильныхУстройств</name>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторУстройства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_НастройкиДокументовМобильныхУстройств/SUI_НастройкиДокументовМобильныхУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_НастройкиДокументовМобильныхУстройств</name>
  <dimensions>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_docs_tbl_goods_delta/SUI_docs_tbl_goods_delta.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs_tbl_goods_delta</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>d_qtty</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_cell</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_good</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_price</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_properties</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_series</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_unit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>price</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>use_series</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипТаблицы</name>
    <type>
      <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>sid_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_СостоянияМобильныхУстройств/SUI_СостоянияМобильныхУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_СостоянияМобильныхУстройств</name>
  <enumValues>
    <name>ЗапросПолнойВыгрузки</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеДанных</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПолучитьДанные</name>
  </enumValues>
  <enumValues>
    <name>Выгружено</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/CommonModules/SUI_МобильныеУстройстваСервер/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ВыполнитьПолнуюВыгрузку(Знач МобильноеУстройство) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегистрыСведений.SUI_СостоянияМобильныхУстройств.СменитьСостояние(
		МобильноеУстройство, 
		Перечисления.SUI_СостоянияМобильныхУстройств.ЗапросПолнойВыгрузки);
	
КонецПроцедуры

Функция МобильноеУстройствоСуществует(ИдентификаторУстройства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SUI_МобильныеУстройства.Ссылка
		|ИЗ
		|	ПланОбмена.SUI_МобильныеУстройства КАК SUI_МобильныеУстройства
		|ГДЕ
		|	SUI_МобильныеУстройства.Код = &ИдентификаторУстройства
		|	И НЕ SUI_МобильныеУстройства.ЭтотУзел";
	
	Запрос.УстановитьПараметр("ИдентификаторУстройства", ИдентификаторУстройства);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Функция МобильноеУстройствоФильтр(МобильноеУстройство, ИсключитьПомеченныеНаУдаление = Истина) Экспорт
	
	ОписаниеТипаМобильноеУстройство = Новый ОписаниеТипов("ПланОбменаСсылка.SUI_МобильныеУстройства");
	МобильноеУстройствоРезультат = ОписаниеТипаМобильноеУстройство.ПривестиЗначение(МобильноеУстройство);
	
	Если МобильноеУстройствоРезультат = ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел() Тогда
		МобильноеУстройствоРезультат = ОписаниеТипаМобильноеУстройство.ПривестиЗначение(Неопределено);
	КонецЕсли;
	
	//@skip-check bsl-legacy-check-string-literal
	Если Не МобильноеУстройствоРезультат.Пустая() И 
		ИсключитьПомеченныеНаУдаление И
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МобильноеУстройствоРезультат, "ПометкаУдаления") Тогда
		МобильноеУстройствоРезультат = ОписаниеТипаМобильноеУстройство.ПривестиЗначение(Неопределено);
	КонецЕсли;
	
	Возврат МобильноеУстройствоРезультат;
	
КонецФункции

Функция ВсеМобильныеУстройства(ВключаяСлужебноеУстройство = Ложь, ИсключитьПомеченныеНаУдаление = Истина) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	SUI_МобильныеУстройства.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.SUI_МобильныеУстройства КАК SUI_МобильныеУстройства
		|ГДЕ
		|	НЕ SUI_МобильныеУстройства.ЭтотУзел
		|	И ВЫБОР
		|			КОГДА &ИсключитьПомеченныеНаУдаление
		|				ТОГДА НЕ SUI_МобильныеУстройства.ПометкаУдаления
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ИсключитьПомеченныеНаУдаление", ИсключитьПомеченныеНаУдаление);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Процедура ЗаписатьСеанс(МобильноеУстройство, ВерсияПриложения = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(МобильноеУстройство) И
		МобильноеУстройство <> ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел() Тогда
		РегистрыСведений.SUI_СеансыМобильныхУстройств.Записать(МобильноеУстройство, ВерсияПриложения);
	КонецЕсли;
	
КонецПроцедуры

Функция СрокДействительностиСеансаВСекундах() Экспорт
	Возврат РегистрыСведений.SUI_СеансыМобильныхУстройств.СрокДействительностиСеансаВСекундах();
КонецФункции

Функция СоздатьМобильноеУстройство(ИдентификаторУстройства, ИмяПользователя) Экспорт
	
	МобильноеУстройство = ПланыОбмена.SUI_МобильныеУстройства.СоздатьУзел(); 
	МобильноеУстройство.Код = ИдентификаторУстройства;
	МобильноеУстройство.Наименование = МобильноеУстройство.Код;
	МобильноеУстройство.Записать();
	
	Возврат МобильноеУстройство.Ссылка;
	
КонецФункции

#Область ЗапросыАвторизации

Функция ПринятьЗапросАвторизацииУстройства(ИдентификаторУстройства) Экспорт
	
	ДанныеЗапросаАвторизации = ПолучитьЗапросАвторизации(ИдентификаторУстройства);
	
	Если Не ЗначениеЗаполнено(ДанныеЗапросаАвторизации) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'Запрос с идентификатором устройства %1 не найден.'"), ИдентификаторУстройства));
		Возврат Неопределено;
	КонецЕсли;
		
	НачатьТранзакцию();
	
	Попытка
		
		МобильноеУстройство = СоздатьМобильноеУстройство(
			ДанныеЗапросаАвторизации.ИдентификаторУстройства, ДанныеЗапросаАвторизации.ИмяПользователя);
		
		УдалитьЗапросАвторизации(ДанныеЗапросаАвторизации.ИдентификаторУстройства);
		
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'Запрос авторизации устройства с идентификатором %1 принят.'"), ИдентификаторУстройства));
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_МобильныеУстройстваКлиентСервер.ИмяСобытия(), ,
			Метаданные.ОбщиеМодули.SUI_МобильныеУстройстваСервер, , ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат МобильноеУстройство;
	
КонецФункции

Функция ПолучитьЗапросАвторизации(ИдентификаторУстройства) Экспорт
	
	ЗапросАвторизации = Неопределено;
	
	Если ПолучитьФункциональнуюОпцию("SUI_ИспользоватьЗапросыАвторизацииМУ") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЗапросыАвторизации.ИдентификаторУстройства КАК ИдентификаторУстройства,
			|	ЗапросыАвторизации.ИмяПользователя,
			|	ЗапросыАвторизации.ДатаОбновления КАК ДатаЗапроса
			|ИЗ
			|	РегистрСведений.SUI_ЗапросыАвторизацииМобильныхУстройств КАК ЗапросыАвторизации
			|ГДЕ
			|	ЗапросыАвторизации.ИдентификаторУстройства = &ИдентификаторУстройства";
		
		Запрос.УстановитьПараметр("ИдентификаторУстройства", ИдентификаторУстройства);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ЗапросАвторизации = Новый ФиксированнаяСтруктура(SUI_ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка));
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат ЗапросАвторизации;
	
КонецФункции

Процедура СоздатьЗапросАвторизации(ИдентификаторУстройства, ИмяПользователя) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("SUI_ИспользоватьЗапросыАвторизацииМУ") Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		МенеджерЗаписи = РегистрыСведений.SUI_ЗапросыАвторизацииМобильныхУстройств.СоздатьМенеджерЗаписи();
	
		МенеджерЗаписи.ИдентификаторУстройства 	= ИдентификаторУстройства;
		МенеджерЗаписи.ИмяПользователя 			= ИмяПользователя;
		МенеджерЗаписи.ДатаОбновления 			= ТекущаяДатаСеанса();
		
		МенеджерЗаписи.Записать(Истина);
	
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_МобильныеУстройстваКлиентСервер.ИмяСобытия(НСтр("ru = 'Запросы авторизации'")), , 
			Метаданные.ОбщиеМодули.SUI_МобильныеУстройстваСервер, , ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Процедура УдалитьЗапросАвторизации(ИдентификаторУстройства) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("SUI_ИспользоватьЗапросыАвторизацииМУ") Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		НаборЗаписей = РегистрыСведений.SUI_ЗапросыАвторизацииМобильныхУстройств.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторУстройства.Установить(ИдентификаторУстройства);
		НаборЗаписей.Записать(Истина);
	
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_МобильныеУстройстваКлиентСервер.ИмяСобытия(НСтр("ru = 'Запросы авторизации'")), , 
			Метаданные.ОбщиеМодули.SUI_МобильныеУстройстваСервер, , ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПодписокНаСобытия

Процедура SUI_МобильноеУстройствоПередЗаписью(Источник, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ЭтоНовый() Тогда
		Источник.ДополнительныеСвойства.Вставить("ЭтоНовый");
	КонецЕсли;
	
	Если Источник.ЭтотУзел Тогда
		
		Источник.IPАдрес 			= "";
		Источник.Порт 				= 0;
		
	Иначе
		
		Источник.Код 		= ОбработатьСтрокуIDУстройства(Источник.Код);
		Источник.IPАдрес 	= ОбработатьСтрокуIPАдреса(Источник.IPАдрес);
		Источник.Порт 		= ?(Источник.Порт = 0, ПортМобильногоУстройстваПоУмолчанию(), Источник.Порт);
		
		УстановитьПривилегированныйРежим(Истина);
		Если Источник.ДополнительныеСвойства.Свойство("ЭтоНовый") Или
			Источник.Настройка <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "Настройка") Тогда
			Источник.ДополнительныеСвойства.Вставить("ЗарегистрироватьНастройкуКВыгрузке");
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура SUI_МобильноеУстройствоПриЗаписи(Источник, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Источник.ЭтотУзел Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	SUI_МобильныеУстройства.Ссылка
			|ИЗ
			|	ПланОбмена.SUI_МобильныеУстройства КАК SUI_МобильныеУстройства
			|ГДЕ
			|	SUI_МобильныеУстройства.Ссылка <> &Ссылка
			|	И SUI_МобильныеУстройства.Код = &Код";
		
		Запрос.УстановитьПараметр("Код", Источник.Код);
		Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'ID ""%1"" уже принадлежит мобильным устройствам:
			|%2'"), Источник.Код, СтрСоединить(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка"), Символы.ПС));
		КонецЕсли;
		
		Если Источник.ДополнительныеСвойства.Свойство("ЭтоНовый") Тогда
			
			// Заполнить всеми настройками документов
			НаборЗаписей = РегистрыСведений.SUI_НастройкиДокументовМобильныхУстройств.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.МобильноеУстройство.Установить(Источник.Ссылка);
			НаборЗаписей.Заполнить(Новый Структура());
			Если НаборЗаписей.Количество() > 0 Тогда
				НаборЗаписей.Записать(Истина);
			КонецЕсли;
			
			ВыполнитьПолнуюВыгрузку(Источник.Ссылка);
			
		КонецЕсли;
		
		Если Источник.ДополнительныеСвойства.Свойство("ЗарегистрироватьНастройкуКВыгрузке") Тогда
			Справочники.SUI_НастройкиМобильныхУстройств
				.ЗарегистрироватьИзмененияНастройкиМобильногоУстройства(Источник.Ссылка);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура SUI_МобильноеУстройствоПередУдалением(Источник, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ПланыОбмена.УдалитьРегистрациюИзменений(Источник.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбновления

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия 				= "1.0.2.1";
	Обработчик.Процедура 			= "SUI_МобильныеУстройстваСервер.УдалитьСлужебноеУстройство_1_0_2_1";
	Обработчик.РежимВыполнения 		= "Оперативно";
	Обработчик.Комментарий 			= НСтр("ru = 'Удаление служебного устройства'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия 				= "1.0.3.9";
	Обработчик.Процедура 			= "SUI_МобильныеУстройстваСервер.ЗаменитьСсылкиМобильныхКлиентов_1_0_3_9";
	Обработчик.РежимВыполнения 		= "Оперативно";
	Обработчик.Комментарий 			= НСтр("ru = 'Замена ссылок мобильных клиентов на ссылки мобильных устройств'");
	
КонецПроцедуры

Процедура УдалитьСлужебноеУстройство_1_0_2_1() Экспорт
	
	Если Метаданные.ПланыОбмена.SUI_МобильныеУстройства.Реквизиты.Найти("Удалить_Служебный") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_МобильныеУстройства.Ссылка
		|ИЗ
		|	ПланОбмена.SUI_МобильныеУстройства КАК SUI_МобильныеУстройства
		|ГДЕ
		|	SUI_МобильныеУстройства.Удалить_Служебный";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МУОбъект = Выборка.Ссылка.ПолучитьОбъект();
		МУОбъект.Удалить();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаменитьСсылкиМобильныхКлиентов_1_0_3_9() Экспорт
	
	Если Метаданные.Справочники.Найти("Удалить_SUI_МобильныеКлиенты") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПарыЗамен = Новый Соответствие();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Удалить_SUI_МобильныеКлиенты.Ссылка КАК МобильныйКлиент,
		|	SUI_МобильныеУстройства.Ссылка КАК МобильноеУстройство
		|ИЗ
		|	Справочник.Удалить_SUI_МобильныеКлиенты КАК Удалить_SUI_МобильныеКлиенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланОбмена.SUI_МобильныеУстройства КАК SUI_МобильныеУстройства
		|		ПО SUI_МобильныеУстройства.Удалить_МобильныйКлиент = Удалить_SUI_МобильныеКлиенты.Ссылка
		|		И НЕ SUI_МобильныеУстройства.ЭтотУзел";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ПарыЗамен.Вставить(Выборка.МобильныйКлиент, Выборка.МобильноеУстройство);
		КонецЦикла;
		
		ПараметрыЗаменыСсылок = ОбщегоНазначения.ПараметрыЗаменыСсылок();
		ПараметрыЗаменыСсылок.ЗаменаПарыВТранзакции = Истина;
		ПараметрыЗаменыСсылок.ПривилегированнаяЗапись = Истина;
		ПараметрыЗаменыСсылок.СпособУдаления = "Удаление";
		ПараметрыЗаменыСсылок.ВключатьБизнесЛогику = Ложь;
		
		Результат = ОбщегоНазначения.ЗаменитьСсылки(ПарыЗамен, ПараметрыЗаменыСсылок);
		
		Если Результат.Количество() > 0 Тогда
			
			УстановитьПривилегированныйРежим(Истина);
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	SUI_docs_tbl_goods_delta.Период,
				|	SUI_docs_tbl_goods_delta.sid,
				|	SUI_docs_tbl_goods_delta.sid_doc,
				|	SUI_docs_tbl_goods_delta.МобильноеУстройство
				|ИЗ
				|	РегистрСведений.SUI_docs_tbl_goods_delta КАК SUI_docs_tbl_goods_delta
				|ГДЕ
				|	SUI_docs_tbl_goods_delta.МобильноеУстройство В (&МобильныеУстройства)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	SUI_НастройкиДокументовМобильныхКлиентов.МобильноеУстройство,
				|	SUI_НастройкиДокументовМобильныхКлиентов.НастройкаДокумента
				|ИЗ
				|	РегистрСведений.SUI_НастройкиДокументовМобильныхУстройств КАК SUI_НастройкиДокументовМобильныхКлиентов
				|ГДЕ
				|	SUI_НастройкиДокументовМобильныхКлиентов.МобильноеУстройство В (&МобильныеУстройства)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////	
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Удалить_SUI_МобильныеКлиенты.Ссылка
				|ИЗ
				|	Справочник.Удалить_SUI_МобильныеКлиенты КАК Удалить_SUI_МобильныеКлиенты
				|ГДЕ
				|	Удалить_SUI_МобильныеКлиенты.Ссылка В (&МобильныеУстройства)";
			
			Запрос.УстановитьПараметр("МобильныеУстройства", 
				ОбщегоНазначенияКлиентСервер.СвернутьМассив(Результат.ВыгрузитьКолонку("Ссылка")));
			
			РезультатыЗапроса = Запрос.ВыполнитьПакет();
			
			Для ИндексЗапроса = 0 По РезультатыЗапроса.ВГраница() Цикл
				
				Если РезультатыЗапроса[ИндексЗапроса].Пустой() Тогда
					Продолжить;
				КонецЕсли;
				
				ЭтоСправочникМобильныхКлиентов = (ИндексЗапроса = РезультатыЗапроса.ВГраница());
				
				Если ЭтоСправочникМобильныхКлиентов Тогда
					МетаданныеОбъекта = Метаданные.Справочники.Удалить_SUI_МобильныеКлиенты;
				ИначеЕсли ИндексЗапроса = 0 Тогда
					МетаданныеОбъекта = Метаданные.РегистрыСведений.SUI_docs_tbl_goods_delta;
				ИначеЕсли ИндексЗапроса = 1 Тогда
					МетаданныеОбъекта = Метаданные.РегистрыСведений.SUI_НастройкиДокументовМобильныхУстройств;
				Иначе
					Продолжить;
				КонецЕсли;
				
				МенеджерОбъекта =  ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(МетаданныеОбъекта.ПолноеИмя());
				ИзмеренияОбъекта = SUI_ОбщегоНазначения.КолонкиРезультатаЗапросаВСтруктуру(РезультатыЗапроса[ИндексЗапроса]);
				
				НачатьТранзакцию();
				
				Попытка
					
					Блокировка = Новый БлокировкаДанных;
					ЭлементБлокировки = Блокировка.Добавить(МетаданныеОбъекта.ПолноеИмя());
					ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
					ЭлементБлокировки.ИсточникДанных = РезультатыЗапроса[ИндексЗапроса];
					Для Каждого ИзмеренияОбъектаКлючЗначение Из ИзмеренияОбъекта Цикл
						ЭлементБлокировки.ИспользоватьИзИсточникаДанных(ИзмеренияОбъектаКлючЗначение.Ключ, ИзмеренияОбъектаКлючЗначение.Ключ);
					КонецЦикла;
					Блокировка.Заблокировать();
					
					Выборка = РезультатыЗапроса[ИндексЗапроса].Выбрать();
					
					Пока Выборка.Следующий() Цикл
						
						Если ЭтоСправочникМобильныхКлиентов Тогда
							
							Для Каждого ИзмеренияОбъектаКлючЗначение Из ИзмеренияОбъекта Цикл
								СправочникОбъект = Выборка[ИзмеренияОбъектаКлючЗначение.Ключ].ПолучитьОбъект();
								СправочникОбъект.Удалить();
							КонецЦикла;
							
						Иначе
							
							НаборЗаписей = МенеджерОбъекта.СоздатьНаборЗаписей();
					
							Для Каждого ИзмеренияОбъектаКлючЗначение Из ИзмеренияОбъекта Цикл
								НаборЗаписей.Отбор[ИзмеренияОбъектаКлючЗначение.Ключ]
									.Установить(Выборка[ИзмеренияОбъектаКлючЗначение.Значение]);
							КонецЦикла;
							
							НаборЗаписей.ОбменДанными.Загрузка = Истина;
							НаборЗаписей.Записать();
							
						КонецЕсли;
						
					КонецЦикла;
					
					ЗафиксироватьТранзакцию();
					
				Исключение
					ОтменитьТранзакцию();
					ВызватьИсключение;
				КонецПопытки;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработатьСтрокуIDУстройства(IDУстройства)
	Возврат SUI_СтроковыеФункцииКлиентСервер.ПривестиСтрокуКРазрешеннымСимволам(СокрЛП(НРег(IDУстройства)), 
		SUI_СтроковыеФункцииКлиентСервер.АлфавитЦифры() + SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыЛатинские());
КонецФункции

Функция ОбработатьСтрокуIPАдреса(Знач IPАдрес)
	
	IPАдрес = SUI_СтроковыеФункцииКлиентСервер.ПривестиСтрокуКРазрешеннымСимволам(СокрЛП(IPАдрес), 
		SUI_СтроковыеФункцииКлиентСервер.АлфавитЦифры() + ".");
		
	РазрядыIPАдрес = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(IPАдрес, ".", Истина);
	
	ОсталосьДобавитьРазрядов = (4 - РазрядыIPАдрес.Количество());
	
	Если ОсталосьДобавитьРазрядов > 0 Тогда
		Для индекс = 1 По ОсталосьДобавитьРазрядов Цикл
			РазрядыIPАдрес.Добавить("0");
		КонецЦикла;
	КонецЕсли;
	
	ОбработанныеРазряды = Новый Массив();
	Для индекс = 0 По 3 Цикл
		ОбработанныеРазряды.Добавить(СокрЛП(Лев(РазрядыIPАдрес[индекс], 3)));
	КонецЦикла;
	
	Возврат СтрСоединить(ОбработанныеРазряды, ".");
	
КонецФункции

Функция ПортМобильногоУстройстваПоУмолчанию()
	Возврат 8095;
КонецФункции

#КонецОбласти
